Model: "recommender_net"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        multiple                  30500     
_________________________________________________________________
embedding_1 (Embedding)      multiple                  610       
_________________________________________________________________
embedding_2 (Embedding)      multiple                  486200    
_________________________________________________________________
embedding_3 (Embedding)      multiple                  9724      
=================================================================
Total params: 527,034
Trainable params: 527,034
Non-trainable params: 0
_________________________________________________________________